Autodesk.Revit.DB.IFC.IFCTransformSetter.Initialize(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Transform)
Initializes the transformation in the transform setter.
exporterIFC:
The exporter.
transform:
The transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCTransformSetter.InitializeFromBoundingBox(Autodesk.Revit.DB.IFC.ExporterIFC,System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.IFC.IFCExtrusionCreationData)
Initializes the transformation in the transform setter.
exporterIFC:
The exporter.
geometryList:
The set of geometry used to determine the bounding box.
exportBodyParams:
The extrusion creation data which contains the local placement.
Returns:
The transform corresponding to the movement, if any.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCTransformSetter.Create
Creates a new instance of a transform setter.
Returns:
The new transform setter.
Since:
2012

Autodesk.Revit.DB.IFC.IFCTransformSetter.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCTransformSetter
A state-based class that forces an extra transformation applied to objects being exported.
Remarks:
IFC has a system of local placements; these are created from a set of transforms in Revit.
Sometimes there is a need to create a 'fake' transform to get the right local placement structure for IFC.
This class is intended to maintain the transformation for the duration that it is needed.
To ensure that the lifetime of the object is correctly managed, you should declare an instance
of this class as a part of a 'using' statement in C# or
similar construct in other lanuguages.
Since:
2012